charliermarsh.ruff
eamodio.gitlens
github.copilot
github.copilot-chat
ionutvmi.path-autocomplete
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
mutantdino.resourcemonitor
njpwerner.autodocstring
redhat.vscode-yaml
shardulm94.trailing-spaces
tamasfe.even-better-toml
vscode-icons-team.vscode-icons